Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: An image to texture the quad with.
pt_br: Uma imagem para texturizar o quad.

source: fontData = love.font.newFontData( rasterizer )
pt_br: dadoDeFonte = love.font.newFontData( rasterizador )

source: Windows Vista and 7: C:\Users\user\AppData\Roaming\LOVE or %appdata%\LOVE\
pt_br: Windows Vista e 7: C:\Users\user\AppData\Roaming\LOVE or %appdata%\LOVE\

source: supportN
pt_br: suporteN

source: function love.load() stars = {} -- table which will hold our stars max_stars = 100 -- how many stars we want for i=1, max_stars do -- generate the coords of our stars local x = math.random(5, love.graphics.getWidth()-5) -- generate a "random" number for the x coord of this star local y = math.random(5, love.graphics.getHeight()-5) -- both coords are limited to the screen size, minus 5 pixels of padding stars[i] = {x, y} -- stick the values into the table end end function love.draw() for i=1, #stars do -- loop through all of our stars love.graphics.point(stars[i][1], stars[i][2]) -- draw each point end end
pt_br: function love.load() estrelas = {} -- tabela que vai conter nossas estrelas max_estrelas = 100 -- quantas estrelas queremos for i=1, max_estrelas do -- gera as coordenadas das nossas estrelas local x = math.random(5, love.graphics.getWidth()-5) -- gera um número "aleatório" para a coordenada x desta estrela local y = math.random(5, love.graphics.getHeight()-5) -- ambas coordenadas se limitam ao tamanho da tela, menos 5 pixels de margem stars[i] = {x, y} -- insere os valores na tabela end end function love.draw() for i=1, #estrelas do -- iterar por todas as nossas estrelas love.graphics.point(estrelas[i][1], estrelas[i][2]) -- desenha cada ponto end end

source: One can also use a negative scaling factor to flip about its centerline.
pt_br: Também se pode usar um fator de redimensionamento negativo para virar a partir do centro.

source: Creates a new [[Image]].
pt_br: Cria uma nova [[Image (Português)|Imagem]].

source: function love.keypressed(k) if k == 'escape' then love.event.push('quit') -- Quit the game. end end
pt_br: function love.keypressed(k) if k == 'escape' then love.event.push('quit') -- Sai do jogo. end end

source: sfx = love.audio.newSource("sfx.wav", "static") love.audio.play(sfx)
pt_br: efeito = love.audio.newSource("efeito.wav", "static") love.audio.play(efeito)

source: archive
pt_br: arquivo

source: width (window_width)
pt_br: largura (largura_da_janela)

source: Unmounts a zip file or folder previously mounted with [[love.filesystem.mount]].
pt_br: Desmonta arquivo zip ou pasta montada com [[love.filesystem.mount (Português)|love.filesystem.mount]].

source: * [[ImageData:encode]]
pt_br: * [[ImageData:encode (Português)|DadoDeImagem:encode]]

source: There is an [http://feedback.wildfiregames.com/report/opengl/feature/GL_MAX_TEXTURE_SIZE online database] which has collected info about the max image size for various systems.
pt_br: Existe um [http://feedback.wildfiregames.com/report/opengl/feature/GL_MAX_TEXTURE_SIZE banco de dados online] que coletou informações sobre o tamanho máximo de imagem de vários sistemas.

source: The width of the box.
pt_br: A largura da área.

source: The dimensions of the scissor is unaffected by graphical transformations (translate, scale, ...).
pt_br: As dimensões do recorte não são afetadas por transformações gráficas (translação, redimensionamento, ...).

source: Mount a zip file.
pt_br: Montar um arquivo zip.

source: Arguments
pt_br: Argumentos

source: Also, the position of the origin can be specified on the screen coordinate system.
pt_br: Além disso, a posição de origem pode ser especificada no sistema de coordenadas da tela.

source: The image to use.
pt_br: A imagem a ser usada.

source: Canvas
pt_br: Pintura

source: fontData
pt_br: dadoDeFonte

source: errormsg (nil)
pt_br: msgerro (nil)

source: Gets the current Font object.
pt_br: Obtém o objeto Fonte atual.

source: Second event argument.
pt_br: Segundo argumento do evento.

source: Write data to a file.
pt_br: Escrever dados num arquivo.

source: It is safe to assume it will never be less than 1024 and will almost always be 2048 or greater.
pt_br: É seguro supor que nunca será menos que 1024 e será quase sempre 2048 ou mais.

source: The height of the box.
pt_br: A altura da área.

source: Changelog
pt_br: Registro de mudanças

source: The color mode to use.
pt_br: O modo de cor a ser usado.

source: Gets whether the game is in fused mode or not.
pt_br: Descobre se um jogo está em modo fundido ou não.

source: fx, fy, fz, ux, uy, uz = love.audio.getOrientation( )
pt_br: dx, dy, dz, sx, sy, sz = love.audio.getOrientation( )

source: The maximum repeat is 255, and the minimum repeat is 1.
pt_br: O máximo de repetição é 255 e o mínimo é 1.

source: Sets the [[BlendMode|blending mode]].
pt_br: Configura o [[BlendMode (Português)|modo de mistura]].

source: love.audio.play( source )
pt_br: love.audio.play( fonte )

source: Sets the render target to a specified [[Framebuffer]].
pt_br: Configura um [[Framebuffer (Português)|Framebuffer]] especificado como o alvo da renderização.

source: size = love.graphics.getPointSize( )
pt_br: tamanho = love.graphics.getPointSize( )

source: The new SpriteBatch.
pt_br: O novo LoteDeSprites.

source: The x position of the listener.
pt_br: A posição em x do ouvinte.

source: * [[ love.graphics.setStencil]]
pt_br: * [[ love.graphics.setStencil (Português)|love.graphics.setStencil]]

source: Added shearing factors ''kx'' and ''ky''
pt_br: Adicionados fatores de inclinação "ix" e "iy"

source: Captures drawing operations to a Framebuffer
pt_br: Captura operações de desenho em um Framebuffer]

source: Draw a Quad with the specified Image on screen.
pt_br: Desenha um Quad com a imagem especificada na tela.

source: This change lasts until love.draw() exits.
pt_br: Essa mudança dura até a saída da função love.draw().

source: The current master volume
pt_br: O volume mestre atual.

source: All drawing operations until the next love.graphics.setRenderTarget will be redirected to the [[Framebuffer]] and not shown on the screen.
pt_br: Todas operações de desenho até o próximo love.graphics.setCanvas serão redirecionadas ao [[Framebuffer (Português)|Framebuffer]] e não serão mostradas na tela.

source: Sets or resets a [[Shader]] as the current pixel effect or vertex shaders.
pt_br: Configura ou desconfigura um [[Shader (Português)|Shader]] como o efeito de pixel ou shader de vértice atual.

source: file, errorstr = love.filesystem.newFile( filename, mode )
pt_br: arquivo, stringDeErro = love.filesystem.newFile( nomeDoArquivo, modo )

source: Gets the current color.
pt_br: Obtém a cor atual.

source: This variant creates a new font using the default font and the size specified, and sets it as the current font.
pt_br: Esta variante cria uma nova fonte usando a fonte padrão e o tamanho especificado, e a configura como fonte atual.

source: font = love.graphics.setNewFont( filename, size )
pt_br: fonte = love.graphics.setNewFont( nomeDoArquivo, tamanho )

source: * [[love.graphics.setPoint]]
pt_br: * [[love.graphics.setPoint (Português)|love.graphics.setPoint]]

source: This function does not work in 0.8.0, but has been fixed in version 0.9.0.
pt_br: Esta função não funciona no 0.8.0, mas foi consertada na versão 0.9.0.

source: join
pt_br: juncao

source: AlignMode
pt_br: ModoDeAlinhar

source: The red component (0-255).
pt_br: A componente vermelha (0-255).

source: -- load ttf file font. set 20px font-size mainFont = love.graphics.newFont("anyfont.ttf", 20); function love.draw() -- set font before draw text love.graphics.setFont(mainFont); -- draw text "Hello world!" at left: 100, top: 200 love.graphics.print("Hello world!", 100, 200); end;
pt_br: -- carregar arquivo fonte ttf. definir tamanho de fonte de 20px fontePrincipal = love.graphics.newFont("qualquerfonte.ttf", 20); function love.draw() -- definir a fonte antes de desenhar o texto love.graphics.setFont(fontePrincipal); -- desenhar o texto "Alô, mundo!" em esquerda: 100, topo: 200 love.graphics.print("Alô, mundo!", 100, 200); end;

source: Returns the current PixelEffect.
pt_br: Retorna o EfeitoDePixel atual.

source: chunk = love.filesystem.load( name ) -- load the chunk local result = chunk() -- execute the chunk print('result: ' .. tostring(result)) -- prints 'result: 2'
pt_br: bloco = love.filesystem.load( nome ) -- carrega o bloco local resultado = bloco() -- executa o bloco print('resultado: ' .. tostring(resultado)) -- imprimie 'resultado: 2'

source: Note that you can only set the name of the folder to store your files in, not the location.
pt_br: Note que é possível somente configurar o nome da pasta que armazenará os arquivos, não a sua localização.

source: All canvas arguments must have the same widths and heights and the same [[TextureMode|texture type]].
pt_br: Todos os argumentos pintura precisam ter a mesma largura e altura e o mesmo [[TextureMode (Português)|tipo de textura]].

source: The table is not sorted in any way; the order is undefined.
pt_br: A tabela não é organizada de modo nenhum; a ordem é indefinida.

source: * [[love.graphics.translate]]
pt_br: * [[love.graphics.translate (Português)|love.graphics.translate]]

source: Draws formatted text, with word wrap and alignment.
pt_br: Desenha texto formatado, com quebra de linha e alinhamento.

source: The max number of particles at the same time.
pt_br: O número máximo de partículas ao mesmo tempo.

source: Using an Image as a mask
pt_br: Usando uma Imagem como máscara

source: True if everything is supported, false otherwise.
pt_br: Verdadeiro se tudo for suportado, senão, falso.

source: 0x3F07 would equal to 0011111100000111 in binary.
pt_br: 0x3F07 é equivalente a 0011111100000111 em binário.

source: In many cases, you draw images or shapes in terms of their upper-left corner (See the picture above).
pt_br: Em muitos casos, você vai desenhar imagens ou formas em em relação a seus cantos superiores esquerdos (Ver imagem acima).

source: data = love.sound.newSoundData("sfx.wav") sfx = love.audio.newSource(data)
pt_br: dado = love.sound.newSoundData("efeito.wav") efeito = love.audio.newSource(dado)

source: The pixel effect code.
pt_br: O código do efeito de pixel.

source: The position of the top left corner along y-axis.
pt_br: A posição do canto superior esquerdo no eixo y.

source: Draws a triangle.
pt_br: Desenha um triângulo.

source: style = love.graphics.getPointStyle( )
pt_br: estilo = love.graphics.getPointStyle( )

source: Coordinates of the pixel on the screen. Pixel coordinates are not normalized (unlike texture coordinates)
pt_br: Coordenadas do pixel na tela. Coordenadas de pixel não são normalizadas (diferentemente de coordenadas de textura)

source: font = love.graphics.setNewFont( size )
pt_br: fonte = love.graphics.setNewFont( tamanho )

source: This variant is not supported in that and later versions
pt_br: Esta variante não é suportada nessa versão e posteriores

source: filepath
pt_br: caminhoDeArquivo

source: pattern
pt_br: padrao

source: cwd = love.filesystem.getWorkingDirectory( )
pt_br: dta = love.filesystem.getWorkingDirectory( )

source: Sets the point size and style.
pt_br: Configura o tamanho e o estilo de ponto.

source: * [[HSL color]]
pt_br: * [[HSL color (Português)|Cor HSL]]

source: A CompressedData object. The Image will use this CompressedData to reload itself when [[love.window.setMode]] is called.
pt_br: Um objeto DadoComprimido. A imagem usará este DadoComprimido para se recarregar quando [[love.window.setMode (Português)| love.window.setMode]] for chamada.

source: This affects all graphics calls, including [[love.graphics.clear]].
pt_br: Isso afeta todas as chamadas gráficas, incluindo [[love.graphics.clear (Português)|love.graphics.clear]].

source: love.graphics.print( text, x, y, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.print( texto, x, y, r, ex, ey, ox, oy, ix, iy )

source: cwd
pt_br: dta

source: A pattern is read from back to front.
pt_br: Um padrão é lido de trás para frente.

source: appendToPath (false)
pt_br: acrescentarACaminho (false)

source: It has replaced [[love.graphics.drawq]]
pt_br: Substituiu [[love.graphics.drawq (Português)|love.graphics.drawq]]

source: for e, a, b, c in love.event.poll() do if e == "q" then -- Quit! end end
pt_br: for e, a, b, c, d in love.event.poll() do if e == "q" then -- Sair! end end

source: CompressedData
pt_br: DadoComprimido

source: system = love.graphics.newParticleSystem( texture, buffer )
pt_br: sistema = love.graphics.newParticleSystem( textura, buffer )

source: * [[love.graphics.setDefaultImageFilter]]
pt_br: * [[love.graphics.setDefaultImageFilter (Português)|love.graphics.setDefaultImageFilter]]

source: The filename of the file.
pt_br: O nome do arquivo.

source: * [[ love.filesystem]]
pt_br: * [[ love.filesystem (Português)|love.filesystem]]

source: love.graphics.setPoint( size, style )
pt_br: love.graphics.setPoint( tamanho, estilo )

source: * [[love.graphics.setFont]]
pt_br: * [[love.graphics.setFont (Português)|love.graphics.setFont]]

source: repeat (1)
pt_br: repeticao (1)

source: In version 0.8.0 and older, love.graphics.print stops at the first '\0' (null) character.
pt_br: Nas versões 0.8.0 e anteriores, love.graphics.print para no primeiro caracter "\0" (nulo).

source: A new Canvas with width/height equal to the window width/height.
pt_br: Uma nova Pintura com altura/largura iguais às altura/largura da janela.

source: path = love.filesystem.getAppdataDirectory( )
pt_br: caminho = love.filesystem.getAppdataDirectory( )

source: Gets the line style.
pt_br: Obtém o estilo de linha.

source: The v texture coordinate. Texture coordinates are normally in the range of [0, 1], but can be greater or less (see [[WrapMode]].)
pt_br: A textura de coordenada v. Coordenadas de textura ficam normalmente na faixa de [0, 1] mas podem ser menos ou mais (veja [[WrapMode (Português)|ModoDeAcondicionar]].)

source: Objects are drawn relative to their local coordinate system.
pt_br: Objetos são desenhados em relação ao seu sistema de coordenadas local

source: love.graphics.setLineWidth( width )
pt_br: love.graphics.setLineWidth( espessura )

source: Copies and pushes the current coordinate transformation to the transformation stack.
pt_br: Copia e empilha a transformação de coordenadas atual na pilha de transformações.

source: Other Languages
pt_br: Outras Línguas

source: * [[ Framebuffer]]
pt_br: * [[ Framebuffer (Português)|Framebuffer]]

source: * [[love.graphics.setPixelEffect]]
pt_br: * [[love.graphics.setPixelEffect (Português)|love.graphics.setPixelEffect]]

source: Creates a screenshot and returns the image data.
pt_br: Captura a tela e retorna o dado de imagem.

source: mode = love.graphics.getBlendMode( )
pt_br: modo = love.graphics.getBlendMode( )

source: The current Font, or nil if none is set.
pt_br: A Fonte atual, ou nil se nenhuma estiver configurada.

source: Mounts a zip file or folder in the game's save directory for reading.
pt_br: Monta um arquivo zip ou uma pasta no diretório de escrita do jogo para leitura.

source: Texture
pt_br: Textura

source: The Data object to write to the file.
pt_br: O objeto Dado a ser escrito no arquivo.

source: How to draw the triangle.
pt_br: Como o triângulo será desenhado.

source: Calling this function affects all future drawing operations by rotating the coordinate system around the origin by the given amount of radians.
pt_br: A chamada desta função afeta todas as operações futuras de desenho, rotacionando o sistema de coordenadas em torno da origem, de acordo com a medida em radianos.

source: success = love.filesystem.mount( archive, mountpoint )
pt_br: sucesso = love.filesystem.mount( arquivo, pontoDeMontagem )

source: Function
pt_br: Função

source: Whether the green color component is active when rendering.
pt_br: Se o componente de cor verde é ativo ou não ao renderizar.

source: Mesh
pt_br: Malha

source: True if the file/directory was removed, false otherwise.
pt_br: Verdadeiro se o arquivo/diretório tiver sido removido, senão, falso.

source: The [[SourceType]] of the returned audio is "static".
pt_br: O [[SourceType (Português)|TipoDeFonte]] do áudio retornado é "static".

source: The table filled with vertex information tables for each vertex as follows:
pt_br: A tabela contendo tabelas de informação para cada vértice da seguinte forma:

source: It has been renamed to [[love.graphics.getShader]]
pt_br: Foi renomeado para [[love.graphics.getShader]]

source: The green color component.
pt_br: O componente de cor verde.

source: The quad to draw on screen.
pt_br: O quad a ser desenhado na tela.

source: modtime, errormsg = love.filesystem.getLastModified("file.dat") if modtime then print(os.date("%c", modtime)) -- "02/15/2011 12:32:11" (Depends on the system and locale) end
pt_br: horamod, msgerro = love.filesystem.getLastModified("arquivo.dat") if horamod then print(os.date("%c", horamod)) -- "02/15/2011 12:32:11" (Depende do sistema e do locale) end

source: The alpha color component.
pt_br: O componente de cor alfa.

source: Render green component.
pt_br: Renderizar componente verde.

source: love.event.pump can only be called from the main thread, but afterwards, the rest of love.event can be used from any other thread.
pt_br: love.event.pump só pode ser chamada da thread principal, mas, depois, o resto de love.event pode ser usado de qualquer outra thread.

source: The desired height of the Canvas.
pt_br: A altura desejada para a Pintura.

source: ky
pt_br: iy

source: Your new FileData.
pt_br: Seu novo DadoDeArquivo.

source: mode
pt_br: modo

source: In either case the arguments are interpreted as alternating x and y coordinates of the polygon's vertices.
pt_br: Em ambos casos, os argumentos são interpretados alternadamente como coordenadas x e y dos vértices do polígono.

source: Function that defines the new stencil.
pt_br: Função que define o novo estêncil.

source: files = love.filesystem.getDirectoryItems( dir )
pt_br: arquivos = love.filesystem.getDirectoryItems( dir )

source: Set an already-loaded [[Font]] as the current font or create and load a new one from the file and size.
pt_br: Configura como fonte atual uma [[Font (Português)|Fonte]] já carregada ou cria e carrega uma nova a partir do arquivo e do tamanho.

source: * [[love.graphics.setPointSize]]
pt_br: * [[love.graphics.setPointSize (Português)|love.graphics.setPointSize]]

source: In versions prior to [[0.9.0]], LÖVE expects ISO 8859-1 encoding for the glyphs string.
pt_br: Em versões anteriores à [[0.9.0]], o LÖVE espera a codificação ISO 8859-1 para o string de glifos.

source: numSources
pt_br: numFontes

source: Older and low-end systems do not always support all graphics extensions.
pt_br: Sistemas mais antigos e baratos nem sempre suportam todas as extensões gráficas.

source: Rewinds all playing audio.
pt_br: Rebobina todo o áudio que estiver tocando.

source: ky (0)
pt_br: iy (0)

source: Sets the color mask.
pt_br: Configura a máscara de cor.

source: pe = love.graphics.getPixelEffect( )
pt_br: edp = love.graphics.getPixelEffect( )

source: love.graphics.setLineStipple( pattern, repeat )
pt_br: love.graphics.setLineStipple( padrao, repeticao )

source: * [[ SpriteBatch]]
pt_br: * [[ SpriteBatch (Português)|LoteDeSprites]]

source: Note that this only returns the name of the folder to store your files in, not the full location.
pt_br: Repare que isso apenas retorna o nome da pasta para guardar seus arquivos, não a localização completa.

source: The Quad then describes the rectangular area of dimensions width × height whose upper left corner is at position (x, y) inside the scaled object.
pt_br: O Quad então descreve a área retangular de dimensões largura x altura cujo canto superior esquerdo está na posição (x, y) dentro do objeto redimensionado.

source: LÖVE provides several built-in variables for both pixel and vertex shaders.
pt_br: O LÖVE oferece várias variáveis embutidas para shaders tanto de pixel quanto de vértice.

source: A Font object which can be used to draw text on screen.
pt_br: Um objeto Fonte que pode ser usado para desenhar texto na tela.

source: True to enable wireframe mode when drawing, false to disable it.
pt_br: Verdadeiro para ativar o modo de estrutura de arame ao desenhar, falso para desativá-lo.

source: Vertex and Pixel shader code can be combined into one file or string if you wrap the vertex-specific code in #ifdef VERTEX .. #endif and the pixel-specific code in #ifdef PIXEL .. #endif .
pt_br: O código dos shaders de Vértice e de Pixel pode ser combinado em um arquivo ou string, se você embrulhar o código específico do vértice em #ifdef VERTEX .. #endif e o código específico do pixel em #ifdef PIXEL .. #endif .

source: Creates a circle and draws it more efficiently than love.graphics.circle.
pt_br: Cria um círculo e o desenha com mais eficiência que love.graphics.circle.

source: love.graphics.setCanvas( canvas1, canvas2, ... )
pt_br: love.graphics.setCanvas( pintura1, pintura2, ... )

source: Setting the game folder name
pt_br: Configurando o nome da pasta do jogo

source: The transformation matrix affected by [[love.graphics.translate]] and friends combined with the orthographic projection matrix.
pt_br: A matriz de transformação afetada por [[love.graphics.translate (Português)|love.graphics.translate]] e seus amigos combinada com a matriz de projeção ortográfica.

source: If the path passed to the function exists in the game and the save directory, it will list the files and directories from both places.
pt_br: Se o caminho dado à função existir nos diretórios de jogo e de escrita, serão listados arquivos e diretórios de ambos lugares.

source: love.graphics.drawq( canvas, quad, x, y, r, sx, sy, ox, oy, kx, ky )
pt_br: love.graphics.drawq( pintura, quad, x, y, r, ex, ey, ox, oy, ix, iy )

source: Draw the outline of a simple trapezoid.
pt_br: Desenhar o contorno de um simples trapézio.

source: Vertex shader code must contain at least one function, named position , which is the function that will produce transformed vertex positions of drawn objects in screen-space.
pt_br: O código de shaders de vértice deve conter pelo menos uma função, chamada position (posição), que é a função que produzirá posições transformadas de vértices de objetos desenhados no espaço da tela.

source: Pixel shaders are sometimes called fragment shaders.
pt_br: Shaders de pixel são às vezes chamados de shaders de fragmento.

source: This example shows how to rotate a static scene around a given point.
pt_br: Este exemplo mostra como rotacionar uma cena estática ao redor de um determinado ponto.

source: [[love.math.triangulate]] and [[love.math.isConvex]] can be used in [[0.9.0]]+.
pt_br: [[love.math.triangulate (Português)|love.math.triangulate]] e [[love.math.isConvex (Português)|love.math.isConvex]] podem ser usados no [[0.9.0]] ou posteriores.

source: A PixelEffect object for use in drawing operations.
pt_br: Um objeto EfeitoDePixel usado em operações de desenho.

source: bgm = love.audio.newSource("bgm.ogg", "stream") love.audio.play(bgm)
pt_br: mdf = love.audio.newSource("mdf.ogg", "stream") love.audio.play(mdf)

source: spriteBatch = love.graphics.newSpriteBatch( texture, size, usagehint )
pt_br: loteDeSprites = love.graphics.newSpriteBatch( textura, tamanho, dicadeuso )

source: * [[love.graphics.getScissor]]
pt_br: * [[love.graphics.getScissor (Português)|love.graphics.getScissor]]
